"""Случайная непрерывная величина A имеет равномерное распределение на промежутке (200, 800].
Найдите ее среднее значение и дисперсию."""

a = 201
b = 800

M = (a + b)/2
D = (b - a)/12
print(M)
print(D)