"""Задачу 4 решать с помощью функции.
Задача 4. Есть ли статистически значимые различия между средним ростом
дочерей и матерей?
Рост матерей 172, 177, 158, 170, 178,175, 164, 160, 169, 165
Рост взрослых дочерей: 173, 175, 162, 174, 175, 168, 155, 170, 160, 163"""

import numpy as np
from scipy.stats import stats


x = np.array([172, 177, 158, 170, 178,175, 164, 160, 169, 165])
y = np.array([173, 175, 162, 174, 175, 168, 155, 170, 160, 163])
print("1) Mu0: Mu_x = Mu_y")
print("   Mu1: Mu_x != Mu_y")
print("2) alpha = 0.05")

alpha = 0.05
n = len(x)
t1 = stats.t.ppf(alpha / 2, n - 1)
t2 = stats.t.ppf(1 - alpha / 2, n - 1)
print(f"3) t1 = {t1}")
print(f"   t2 = {t2}")
